def menu():
    print('''|---------------学生管理系统----------------|
             | 0、退出系统                               |
             | 1、录入学生信息                           |
             | 2、查询学生成绩                           |
             | 3、删除学生成绩                           |
             | 4、修改学生成绩                           |
             | 5、对学生成绩进行排序                     | 
             | 6、统计学生人数                           |
             | 7、显示所有学生信息                       |
             |------------------------------------------|''')

